grd1079/nxpcup/MK64FL12.h
/*
** End of section using anonymous unions
*/
 
#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif
 
/*!
 * @}
 */ /* end of group Peripheral_access_layer */
 
 
/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */
 
/*!
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */
 
#define DMA_EARS_REG(base)                       This_symbol_has_been_deprecated
#define DMA_EARS                                 This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_0_MASK                    This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_0_SHIFT                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_1_MASK                    This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_1_SHIFT                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_2_MASK                    This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_2_SHIFT                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_3_MASK                    This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_3_SHIFT                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_4_MASK                    This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_4_SHIFT                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_5_MASK                    This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_5_SHIFT                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_6_MASK                    This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_6_SHIFT                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_7_MASK                    This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_7_SHIFT                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_8_MASK                    This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_8_SHIFT                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_9_MASK                    This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_9_SHIFT                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_10_MASK                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_10_SHIFT                  This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_11_MASK                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_11_SHIFT                  This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_12_MASK                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_12_SHIFT                  This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_13_MASK                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_13_SHIFT                  This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_14_MASK                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_14_SHIFT                  This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_15_MASK                   This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_15_SHIFT                  This_symbol_has_been_deprecated
#define ENET_RMON_T_DROP_REG(base)               This_symbol_has_been_deprecated
#define ENET_IEEE_T_DROP_REG(base)               This_symbol_has_been_deprecated
#define ENET_IEEE_T_SQE_REG(base)                This_symbol_has_been_deprecated
#define ENET_RMON_R_RESVD_0_REG(base)            This_symbol_has_been_deprecated
#define ENET_RMON_R_DROP_REG(base)               ENET_IEEE_R_DROP_REG(base)
#define ENET_RMON_R_FRAME_OK_REG(base)           ENET_IEEE_R_FRAME_OK_REG(base)
#define ENET_RMON_T_DROP                         This_symbol_has_been_deprecated
#define ENET_IEEE_T_DROP                         This_symbol_has_been_deprecated
#define ENET_IEEE_T_SQE                          This_symbol_has_been_deprecated
#define ENET_RMON_R_RESVD_0                      This_symbol_has_been_deprecated
#define MCG_C9_REG(base)                         This_symbol_has_been_deprecated
#define MCG_C2_EREFS0_MASK                       MCG_C2_EREFS_MASK
#define MCG_C2_EREFS0_SHIFT                      MCG_C2_EREFS_SHIFT
#define MCG_C2_HGO0_MASK                         MCG_C2_HGO_MASK
#define MCG_C2_HGO0_SHIFT                        MCG_C2_HGO_SHIFT
#define MCG_C2_RANGE0_MASK                       MCG_C2_RANGE_MASK
#define MCG_C2_RANGE0_SHIFT                      MCG_C2_RANGE_SHIFT
#define MCG_C2_RANGE0(x)                         MCG_C2_RANGE(x)
#define MCG_C9                                   This_symbol_has_been_deprecated
#define MCM_PLACR_REG(base)                      This_symbol_has_been_deprecated
#define MCM_PLACR_ARB_MASK                       This_symbol_has_been_deprecated
#define MCM_PLACR_ARB_SHIFT                      This_symbol_has_been_deprecated
#define MCM_PLACR                                This_symbol_has_been_deprecated
 
/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols */
 
 
#else /* #if !defined(MCU_MK64F12) */
  /* There is already included the same memory map. Check if it is compatible (has the same major version) */
  #if (MCU_MEM_MAP_VERSION != 0x0200u)
    #if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
      #warning There are included two not compatible versions of memory maps. Please check possible differences.
    #endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
  #endif /* (MCU_MEM_MAP_VERSION != 0x0200u) */
#endif  /* #if !defined(MCU_MK64F12) */
 
#endif  /* #if !defined(MK64F12_H_) */
 
/* MK64F12.h, eof. */
 
